[
  {
    "idprod": "1",
    "nomprod": "Agua Micelar Desmaquillante",
    "precio": 30000.0,
    "descrip": "Agua micelar que limpia, desmaquilla y tonifica el rostro con suavidad. Ideal para todo tipo de piel, incluso las sensibles. Elimina impurezas y restos de maquillaje de forma eficaz sin irritar. Formato de 400ml.",
    "categoria": "Cuidado Facial",
    "stock": 48,
    "vendidos": 0,
    "rutaImagen": "@../image/aguamicelar.png"
  },
  {
    "idprod": "2",
    "nomprod": "Base de Maquillaje de Larga Duración",
    "precio": 260000.0,
    "descrip": "Base líquida de alta cobertura con acabado mate natural que dura hasta 24 horas. Resiste el calor, la humedad y el ejercicio. Su fórmula es ligera y no comedogénica, perfecta para un look impecable durante todo el día. Disponible en 15 tonos.",
    "categoria": "Maquillaje",
    "stock": 53,
    "vendidos": 0,
    "rutaImagen": "@../image/basediorrr.png"
  },
  {
    "idprod": "3",
    "nomprod": "Esponja BeautyBlender ",
    "precio": 20000.0,
    "descrip": "Esponga de maquillaje con forma de gota, ideal para aplicar y difuminar productos cosmeticos com bases, correctores o primers.",
    "categoria": "Accesorios",
    "stock": 35,
    "vendidos": 0,
    "rutaImagen": "@../image/bb.png"
  },
  {
    "idprod": "4",
    "nomprod": "Set de Brochas Esenciales",
    "precio": 60000.0,
    "descrip": "Set de 12 brochas profesionales de cerdas sintéticas ultra suaves. Incluye brochas para base, polvo, rubor, sombras y difuminado. El estuche portátil facilita su almacenamiento y transporte. Perfectas para looks completos y detallados.",
    "categoria": "Accesorios",
    "stock": 59,
    "vendidos": 0,
    "rutaImagen": "@../image/brochas.png"
  },
  {
    "idprod": "5",
    "nomprod": "Crema Hidratante Facial",
    "precio": 100000.0,
    "descrip": "Crema hidratante enriquecida con ácido hialurónico y vitaminas. Proporciona hidratación profunda, ayudando a regenerar la barrera cutánea. Para uso diario.",
    "categoria": "Cuidado Facial",
    "stock": 31,
    "vendidos": 0,
    "rutaImagen": "@../image/cremaH.png"
  },
  {
    "idprod": "6",
    "nomprod": "Corrector Líquido Mate",
    "precio": 42000.0,
    "descrip": "Corrector líquido de alta cobertura para ocultar imperfecciones, ojeras y rojeces. Su fórmula mate de larga duración no se cuartea ni se asienta en líneas finas. Aplicador de precisión para una cobertura enfocada y una mezcla sencilla. Tono medio.",
    "categoria": "Maquillaje",
    "stock": 41,
    "vendidos": 0,
    "rutaImagen": "@../image/correctorM.png"
  },
  {
    "idprod": "7",
    "nomprod": "Cosmetiquera de Viaje Grande",
    "precio": 88000.0,
    "descrip": "Organizador de maquillaje espacioso y resistente, ideal para viajes. Cuenta con múltiples compartimentos ajustables para guardar productos de diferentes tamaños. Material fácil de limpiar. Diseño elegante y compacto para llevar todo lo esencial.",
    "categoria": "Accesorios",
    "stock": 60,
    "vendidos": 0,
    "rutaImagen": "@../image/Cosmetiquera.png"
  },
  {
    "idprod": "8",
    "nomprod": "Delineador Líquido de Ojos Negro",
    "precio": 45000.0,
    "descrip": "Delineador líquido con punta de fieltro fina para trazos precisos. Su fórmula de color negro intenso es a prueba de agua y de larga duración, garantizando un delineado perfecto sin borrones. Secado rápido y fácil de usar para principiantes.",
    "categoria": "Maquillaje",
    "stock": 51,
    "vendidos": 0,
    "rutaImagen": "@../image/deli.png"
  },
  {
    "idprod": "9",
    "nomprod": "Desmaquillador Bifásico Ojos y Labios",
    "precio": 38000.0,
    "descrip": "Fórmula bifásica que elimina eficazmente el maquillaje a prueba de agua y de larga duración sin dejar residuos grasos. Es suave con la delicada piel de los ojos y labios. Agitar antes de usar para activar sus dos fases. Sin perfume ni alcohol.",
    "categoria": "Cuidado Facial",
    "stock": 43,
    "vendidos": 0,
    "rutaImagen": "@../image/desma.png"
  },
  {
    "idprod": "10",
    "nomprod": "Exfoliante Facial Suave",
    "precio": 55000.0,
    "descrip": "Exfoliante facial con micropartículas que limpian suavemente los poros y eliminan células muertas. Deja la piel con una sensación de frescura y suavidad, mejorando su textura. Uso recomendado de 1 a 2 veces por semana. Enriquecido con extractos naturales.",
    "categoria": "Cuidado Facial",
    "stock": 37,
    "vendidos": 0,
    "rutaImagen": "@../image/exfoliante.png"
  },
  {
    "idprod": "11",
    "nomprod": "Iluminador en Polvo Compacto",
    "precio": 200000.0,
    "descrip": "Iluminador de alta pigmentación con un brillo radiante y multidimensional. Se aplica fácilmente en los pómulos, arco de cupido y cejas. Su textura sedosa se funde con la piel para un resplandor natural. Tono dorado champagne universal.",
    "categoria": "Maquillaje",
    "stock": 46,
    "vendidos": 0,
    "rutaImagen": "@../image/iluminaor.png"
  },
  {
    "idprod": "12",
    "nomprod": "Gloss Dior",
    "precio": 240000.0,
    "descrip": "Dior Addict Lip Maximizer es el gloss icónico de Dior, un verdadero tratamiento hidratante y voluminizador para los labios con un efecto maxi-volumen. Los labios quedan hidratados y sublimados para un acabado luminoso y sofisticado.",
    "categoria": "Maquillaje",
    "stock": 58,
    "vendidos": 0,
    "rutaImagen": "@../image/labail.png"
  },
  {
    "idprod": "13",
    "nomprod": "Labial Rojo",
    "precio": 60000.0,
    "descrip": "Lápiz Labial de larga duración y efecto hidratante. ",
    "categoria": "Maquillaje",
    "stock": 39,
    "vendidos": 0,
    "rutaImagen": "@../image/laaa.png"
  },
  {
    "idprod": "14",
    "nomprod": "Mascarilla Facial Hidratante de Tela",
    "precio": 25000.0,
    "descrip": "Mascarilla de tela enriquecida con suero de ácido hialurónico. Proporciona una explosión de hidratación a la piel en 15 minutos, dejándola visiblemente más jugosa y radiante. Ideal para un tratamiento intensivo de cuidado de la piel. Uso único.",
    "categoria": "Cuidado Facial",
    "stock": 50,
    "vendidos": 0,
    "rutaImagen": "@../image/mascar.png"
  },
  {
    "idprod": "15",
    "nomprod": "Pestañina Volumen y Longitud",
    "precio": 60000.0,
    "descrip": "Máscara de pestañas con cepillo de silicona que alarga y da volumen a las pestañas sin grumos. Fórmula negra intensa, resistente a las lágrimas y de larga duración. Ideal para crear una mirada dramática y definida. Fácil de desmaquillar.",
    "categoria": "Maquillaje",
    "stock": 44,
    "vendidos": 0,
    "rutaImagen": "@../image/pestanina.png"
  },
  {
    "idprod": "16",
    "nomprod": "Paleta de Sombras Neutras",
    "precio": 300000.0,
    "descrip": "Paleta con 12 tonos neutros imprescindibles en acabados mate, satinado y brillante. Textura suave y altamente pigmentada que se difumina sin esfuerzo. Perfecta para looks de día y noche. Incluye un espejo de gran tamaño.",
    "categoria": "Maquillaje",
    "stock": 32,
    "vendidos": 0,
    "rutaImagen": "@../image/paletaasom.png"
  },
  {
    "idprod": "17",
    "nomprod": "Pestañas Postizas de Tira",
    "precio": 22000.0,
    "descrip": "Pestañas postizas de fibra sintética de alta calidad. Proporcionan un volumen y longitud natural, ideales para realzar la mirada. Reutilizables y fáciles de aplicar. El paquete incluye un par de pestañas. No incluye adhesivo.",
    "categoria": "Accesorios",
    "stock": 55,
    "vendidos": 0,
    "rutaImagen": "@../image/pesta.png"
  },
  {
    "idprod": "18",
    "nomprod": "Pestañas Postizas Individuales",
    "precio": 28000.0,
    "descrip": "Pestañas individuales para crear un look personalizado, rellenar espacios y añadir un toque extra de volumen donde se necesite. Vienen en diferentes longitudes (cortas, medias, largas). Fibras ligeras que imitan el pelo natural.",
    "categoria": "Accesorios",
    "stock": 49,
    "vendidos": 0,
    "rutaImagen": "@../image/pestanasP.png"
  },
  {
    "idprod": "19",
    "nomprod": "Polvo Compacto Fijador Translúcido",
    "precio": 180000.0,
    "descrip": "Polvo compacto ultrafino que sella el maquillaje y controla el brillo. Acabado translúcido que no añade color ni deja efecto blanquecino. Ideal para matificar la piel y alargar la duración de la base. Incluye una esponja aplicadora.",
    "categoria": "Maquillaje",
    "stock": 34,
    "vendidos": 0,
    "rutaImagen": "@../image/polvo.png"
  },
  {
    "idprod": "20",
    "nomprod": "Primer Facial Matificante",
    "precio": 58000.0,
    "descrip": "Prebase de maquillaje con efecto matificante que minimiza la apariencia de los poros y alisa la textura de la piel. Crea una superficie perfecta para la aplicación de la base, prolongando su duración y evitando el exceso de grasa en la zona T.",
    "categoria": "Maquillaje",
    "stock": 56,
    "vendidos": 0,
    "rutaImagen": "@../image/primer.png"
  },
  {
    "idprod": "21",
    "nomprod": "Protector Solar TOBOCO Coreano",
    "precio": 120000.0,
    "descrip": "Protector solar de amplio espectro (UVA/UVB) con FPS 50. Fórmula ligera de rápida absorción, ideal para el uso diario bajo el maquillaje. No comedogénico y resistente al agua. Ayuda a prevenir el envejecimiento prematuro causado por el sol.",
    "categoria": "Cuidado Facial",
    "stock": 40,
    "vendidos": 0,
    "rutaImagen": "@../image/protectorsolar.png"
  },
  {
    "idprod": "22",
    "nomprod": "Protector Solar Facial FPS 50",
    "precio": 130000.0,
    "descrip": "Protector solar ligero FPS 50 de rápida absorción, ideal para el uso diario ",
    "categoria": "Cuidado Facial",
    "stock": 36,
    "vendidos": 0,
    "rutaImagen": "@../image/protttt.png"
  },
  {
    "idprod": "23",
    "nomprod": "Rizador de Pestañas Profesional",
    "precio": 80000.0,
    "descrip": "Rizador de pestañas de acero inoxidable con almohadillas de silicona suaves. Su diseño ergonómico se adapta a la forma del ojo para un rizado de larga duración sin pellizcar. Herramienta esencial para una mirada más despierta y abierta.",
    "categoria": "Accesorios",
    "stock": 54,
    "vendidos": 0,
    "rutaImagen": "@../image/rizador.png"
  },
  {
    "idprod": "24",
    "nomprod": "Rodillo Facial de Jade",
    "precio": 55000.0,
    "descrip": "Rodillo de masaje facial de jade natural para mejorar la circulación y promover el drenaje linfático. Ayuda a reducir la hinchazón y las bolsas bajo los ojos. Usar frío para un efecto calmante y tensor. Perfecto para aplicar sueros y cremas.",
    "categoria": "Accesorios",
    "stock": 42,
    "vendidos": 0,
    "rutaImagen": "@../image/rodillo.png"
  },
  {
    "idprod": "25",
    "nomprod": "Rubor Líquido de Larga Duración",
    "precio": 120000.0,
    "descrip": "Rubor líquido altamente pigmentado que se difumina fácilmente para un rubor natural y duradero. Su fórmula ligera se funde perfectamente sobre la piel, ofreciendo un acabado sutil o intenso según se desee. Tono rosa melocotón.",
    "categoria": "Maquillaje",
    "stock": 47,
    "vendidos": 0,
    "rutaImagen": "@../image/rare.png"
  },
  {
    "idprod": "26",
    "nomprod": "Gel Limpiador Facial Profundo",
    "precio": 130000.0,
    "descrip": "Gel limpiador espumoso para uso diario. Limpia profundamente los poros, eliminando el exceso de grasa y las impurezas sin resecar la piel. Deja una sensación de limpieza y frescura. Ideal para pieles mixtas a grasas. En formato de 150ml.",
    "categoria": "Cuidado Facial",
    "stock": 52,
    "vendidos": 0,
    "rutaImagen": "@../image/limpiador.png"
  },
  {
    "idprod": "27",
    "nomprod": "Sérum Effaclar",
    "precio": 120000.0,
    "descrip": "Sérum concentrado con niacinamida (vitamina B3) que ayuda a reducir el enrojecimiento, minimizar los poros y fortalecer la barrera cutánea. Ideal para pieles sensibles y propensas al acné. Textura ligera de rápida absorción. De uso diario.",
    "categoria": "Cuidado Facial",
    "stock": 33,
    "vendidos": 0,
    "rutaImagen": "@../image/la roche.png"
  },
  {
    "idprod": "28",
    "nomprod": "Rubor rosado Dior",
    "precio": 200000.0,
    "descrip": "Enriquecido con tecnología revitalizadora del color, este innovador rubor reacciona al nivel de humedad de la piel al aplicarse para brindar un efecto rosado personalizado. El resultado es un brillo saludable, natural e instantáneo que dura todo el día.",
    "categoria": "Maquillaje",
    "stock": 45,
    "vendidos": 0,
    "rutaImagen": "@../image/labial.png"
  }
]